app/Http/Controllers/Admin/SpecController.php

select * from `specs`
---
  public function add(){
    $spec = Spec::all();